function [ x ] = x( row )
%x : Donne un vecteur x à deux dimensions. Indice 0 donne le nombre de paires
% disponibles.

m(:,1) = [0; 10];
m(:,2) = [-5; 10];
m(:,3) = [-10; 10]; % Solution
m(:,4) = [-15; 10];
m(:,5) = [-20; 10];
m(:,6) = [-30; 10];
m(:,7) = [-50; 10];
m(:,8) = [-60; 10];
m(:,9) = [-80; 10];
m(:,10) = [-100; 10];
% m(:,11) = [10; -1];
% m(:,12) = [12; 10];
% m(:,13) = [15; 22];
% m(:,14) = [-5; 7];
% m(:,15) = [-10; -12];
% m(:,16) = [-12; -10];
% m(:,17) = [-15; 2];
% m(:,18) = [5; -7];
% m(:,19) = [10; -7];
% m(:,20) = [50; 72];
    
if (row == 0)
    x = size(m,2);
else if (row < 1 || row > size(m,2))
    x=m(:,1);
else
    x=m(:,row);
end

end

